yuplus/nxp-mcx-series/MCXE247/periph0/PERI_QUADSPI.h
#define QuadSPI_SOCCR_DQSPADLPEN_MASK            (0x200U)
#define QuadSPI_SOCCR_DQSPADLPEN_SHIFT           (9U)
/*! DQSPADLPEN - When this bit is set the internal generated DQS will be sent to the DQS pad first
 *    and then looped back to QuadSPI. DQSLPEN should be cleared when this bit is set.
 *  0b0..DQS loop back from DQS pad is disabled
 *  0b1..DQS loop back from DQS pad is enabled
 */
#define QuadSPI_SOCCR_DQSPADLPEN(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_DQSPADLPEN_SHIFT)) & QuadSPI_SOCCR_DQSPADLPEN_MASK)

#define QuadSPI_SOCCR_DQSPHASEL_MASK             (0xC00U)
#define QuadSPI_SOCCR_DQSPHASEL_SHIFT            (10U)
/*! DQSPHASEL - Select phase shift for internal DQS generation. These bits are always zero in SDR mode.
 *  0b00..No phase shift
 *  0b01..Select 45 degree phase shift
 *  0b10..Select 90 degree phase shift
 *  0b11..Select 135 degree phase shift
 */
#define QuadSPI_SOCCR_DQSPHASEL(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_DQSPHASEL_SHIFT)) & QuadSPI_SOCCR_DQSPHASEL_MASK)

#define QuadSPI_SOCCR_DQSINVSEL_MASK             (0x1000U)
#define QuadSPI_SOCCR_DQSINVSEL_SHIFT            (12U)
/*! DQSINVSEL - Select clock source for internal DQS generation
 *  0b0..Use 1x internal reference clock for the DQS generation
 *  0b1..Use inverse 1x internal reference clock for the DQS generation
 */
#define QuadSPI_SOCCR_DQSINVSEL(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_DQSINVSEL_SHIFT)) & QuadSPI_SOCCR_DQSINVSEL_MASK)

#define QuadSPI_SOCCR_CK2EN_MASK                 (0x2000U)
#define QuadSPI_SOCCR_CK2EN_SHIFT                (13U)
/*! CK2EN - Flash CK2 clock pin enable
 *  0b0..CK2 flash clock is disabled
 *  0b1..CK2 flash clock is enabled
 */
#define QuadSPI_SOCCR_CK2EN(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_CK2EN_SHIFT)) & QuadSPI_SOCCR_CK2EN_MASK)

#define QuadSPI_SOCCR_DIFFCKEN_MASK              (0x4000U)
#define QuadSPI_SOCCR_DIFFCKEN_SHIFT             (14U)
/*! DIFFCKEN - Differential flash clock pins enable
 *  0b0..Differential flash clock is disabled
 *  0b1..Differential flash clock is enabled
 */
#define QuadSPI_SOCCR_DIFFCKEN(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_DIFFCKEN_SHIFT)) & QuadSPI_SOCCR_DIFFCKEN_MASK)

#define QuadSPI_SOCCR_OCTEN_MASK                 (0x8000U)
#define QuadSPI_SOCCR_OCTEN_SHIFT                (15U)
/*! OCTEN - Octal data pins enable
 *  0b0..QSPI0B_DATAx pins are assigned to QSPI Port B
 *  0b1..QSPI0B_DATAx pins are assigned to QSPI Port A
 */
#define QuadSPI_SOCCR_OCTEN(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_OCTEN_SHIFT)) & QuadSPI_SOCCR_OCTEN_MASK)

#define QuadSPI_SOCCR_DLYTAPSELA_MASK            (0x3F0000U)
#define QuadSPI_SOCCR_DLYTAPSELA_SHIFT           (16U)
/*! DLYTAPSELA - Delay chain tap number selection for QSPI Port A DQS
 *  0b000000..Select 1 delay chain tap
 *  0b000001..Select 2 delay chain tap
 *  0b000010..Select 3 delay chain tap
 *  0b000011..Select 4 delay chain tap
 *  0b000100..Select 5 delay chain tap
 *  0b000101..Select 6 delay chain tap
 *  0b000110..Select 7 delay chain tap
 *  0b000111..Select 8 delay chain tap
 *  0b001000..Select 9 delay chain tap
 *  0b001001..Select 10 delay chain tap
 *  0b001010..Select 11 delay chain tap
 *  0b001011..Select 12 delay chain tap
 *  0b001100..Select 13 delay chain tap
 *  0b001101..Select 14 delay chain tap
 *  0b001110..Select 15 delay chain tap
 *  0b001111..Select 16 delay chain tap
 *  0b010000..Select 17 delay chain tap
 *  0b010001..Select 18 delay chain tap
 *  0b010010..Select 19 delay chain tap
 *  0b010011..Select 20 delay chain tap
 *  0b010100..Select 21 delay chain tap
 *  0b010101..Select 22 delay chain tap
 *  0b010110..Select 23 delay chain tap
 *  0b010111..Select 24 delay chain tap
 *  0b011000..Select 25 delay chain tap
 *  0b011001..Select 26 delay chain tap
 *  0b011010..Select 27 delay chain tap
 *  0b011011..Select 28 delay chain tap
 *  0b011100..Select 29 delay chain tap
 *  0b011101..Select 30 delay chain tap
 *  0b011110..Select 31 delay chain tap
 *  0b011111..Select 32 delay chain tap
 *  0b100000..Select 33 delay chain tap
 *  0b100001..Select 34 delay chain tap
 *  0b100010..Select 35 delay chain tap
 *  0b100011..Select 36 delay chain tap
 *  0b100100..Select 37 delay chain tap
 *  0b100101..Select 38 delay chain tap
 *  0b100110..Select 39 delay chain tap
 *  0b100111..Select 40 delay chain tap
 *  0b101000..Select 41 delay chain tap
 *  0b101001..Select 42 delay chain tap
 *  0b101010..Select 43 delay chain tap
 *  0b101011..Select 44 delay chain tap
 *  0b101100..Select 45 delay chain tap
 *  0b101101..Select 46 delay chain tap
 *  0b101110..Select 47 delay chain tap
 *  0b101111..Select 48 delay chain tap
 *  0b110000..Select 49 delay chain tap
 *  0b110001..Select 50 delay chain tap
 *  0b110010..Select 51 delay chain tap
 *  0b110011..Select 52 delay chain tap
 *  0b110100..Select 53 delay chain tap
 *  0b110101..Select 54 delay chain tap
 *  0b110110..Select 55 delay chain tap
 *  0b110111..Select 56 delay chain tap
 *  0b111000..Select 57 delay chain tap
 *  0b111001..Select 58 delay chain tap
 *  0b111010..Select 59 delay chain tap
 *  0b111011..Select 60 delay chain tap
 *  0b111100..Select 61 delay chain tap
 *  0b111101..Select 62 delay chain tap
 *  0b111110..Select 63 delay chain tap
 *  0b111111..Select 64 delay chain tap
 */
#define QuadSPI_SOCCR_DLYTAPSELA(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_DLYTAPSELA_SHIFT)) & QuadSPI_SOCCR_DLYTAPSELA_MASK)

#define QuadSPI_SOCCR_DLYTAPSELB_MASK            (0x3F000000U)
#define QuadSPI_SOCCR_DLYTAPSELB_SHIFT           (24U)
/*! DLYTAPSELB - Delay chain tap number selection for QSPI Port B DQS
 *  0b000000..Select 1 delay chain tap
 *  0b000001..Select 2 delay chain tap
 *  0b000010..Select 3 delay chain tap
 *  0b000011..Select 4 delay chain tap
 *  0b000100..Select 5 delay chain tap
 *  0b000101..Select 6 delay chain tap
 *  0b000110..Select 7 delay chain tap
 *  0b000111..Select 8 delay chain tap
 *  0b001000..Select 9 delay chain tap
 *  0b001001..Select 10 delay chain tap
 *  0b001010..Select 11 delay chain tap
 *  0b001011..Select 12 delay chain tap
 *  0b001100..Select 13 delay chain tap
 *  0b001101..Select 14 delay chain tap
 *  0b001110..Select 15 delay chain tap
 *  0b001111..Select 16 delay chain tap
 *  0b010000..Select 17 delay chain tap
 *  0b010001..Select 18 delay chain tap
 *  0b010010..Select 19 delay chain tap
 *  0b010011..Select 20 delay chain tap
 *  0b010100..Select 21 delay chain tap
 *  0b010101..Select 22 delay chain tap
 *  0b010110..Select 23 delay chain tap
 *  0b010111..Select 24 delay chain tap
 *  0b011000..Select 25 delay chain tap
 *  0b011001..Select 26 delay chain tap
 *  0b011010..Select 27 delay chain tap
 *  0b011011..Select 28 delay chain tap
 *  0b011100..Select 29 delay chain tap
 *  0b011101..Select 30 delay chain tap
 *  0b011110..Select 31 delay chain tap
 *  0b011111..Select 32 delay chain tap
 *  0b100000..Select 33 delay chain tap
 *  0b100001..Select 34 delay chain tap
 *  0b100010..Select 35 delay chain tap
 *  0b100011..Select 36 delay chain tap
 *  0b100100..Select 37 delay chain tap
 *  0b100101..Select 38 delay chain tap
 *  0b100110..Select 39 delay chain tap
 *  0b100111..Select 40 delay chain tap
 *  0b101000..Select 41 delay chain tap
 *  0b101001..Select 42 delay chain tap
 *  0b101010..Select 43 delay chain tap
 *  0b101011..Select 44 delay chain tap
 *  0b101100..Select 45 delay chain tap
 *  0b101101..Select 46 delay chain tap
 *  0b101110..Select 47 delay chain tap
 *  0b101111..Select 48 delay chain tap
 *  0b110000..Select 49 delay chain tap
 *  0b110001..Select 50 delay chain tap
 *  0b110010..Select 51 delay chain tap
 *  0b110011..Select 52 delay chain tap
 *  0b110100..Select 53 delay chain tap
 *  0b110101..Select 54 delay chain tap
 *  0b110110..Select 55 delay chain tap
 *  0b110111..Select 56 delay chain tap
 *  0b111000..Select 57 delay chain tap
 *  0b111001..Select 58 delay chain tap
 *  0b111010..Select 59 delay chain tap
 *  0b111011..Select 60 delay chain tap
 *  0b111100..Select 61 delay chain tap
 *  0b111101..Select 62 delay chain tap
 *  0b111110..Select 63 delay chain tap
 *  0b111111..Select 64 delay chain tap
 */
#define QuadSPI_SOCCR_DLYTAPSELB(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_DLYTAPSELB_SHIFT)) & QuadSPI_SOCCR_DLYTAPSELB_MASK)
/*! @} */

/*! @name BUF0IND - Buffer0 Top Index Register */
/*! @{ */

#define QuadSPI_BUF0IND_TPINDX0_MASK             (0xFFFFFFF8U)
#define QuadSPI_BUF0IND_TPINDX0_SHIFT            (3U)
#define QuadSPI_BUF0IND_TPINDX0(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF0IND_TPINDX0_SHIFT)) & QuadSPI_BUF0IND_TPINDX0_MASK)
/*! @} */

